Revit 2026 API

# AnalyticalElementIsValidTransform Method

---

Checks whether the value set for Local Coordinate System is valid for an Analytical Element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidTransform(
	Transform trf
)
```
```vb
Public Function IsValidTransform (
	trf As Transform
) As Boolean
```
```cpp
public:
bool IsValidTransform(
	Transform^ trf
)
```
```fsharp
member IsValidTransform :
        trf : Transform -> bool
```

#### Parameters

trf Transform
     The value set to be verified.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Origin should be equal with Origin from GetTransform Z axis should be parallel with Analytical Element's plane's normal. X and Y axis should be in Analytical Element's plane. For non-planar elements the X or Y axis should be tangent at transform origin.

#### Reference

AnalyticalElement Class

Autodesk.Revit.DB.Structure Namespace